app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "potato"], ["description", "cake and cakes"], ["created_at", "2017-06-25 01:26:37.900141"], ["updated_at", "2017-06-25 01:26:37.900141"]]
---
    def create
        @article = Article.new(article_params)
        if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "who has the little? we got it. poots."], ["updated_at", "2017-06-25 02:19:14.498965"], ["id", 6]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)